const list = [
    { id: 1, name: 'ООО КБ "Ярославич"', bik: '0123456789', coracc: 476534765834465, address: 'г.Ярославль, ул.Свободы, 1' },
    { id: 2, name: 'ОАО "Бинбанк"', bik: '0123456890', coracc: 476534765834465, address: 'г.Комсомольск на Амуре, ул.Красного знамени, 67' },
    { id: 3, name: 'ОАО "Северный банк сбербанка России"', bik: '0123456456', coracc: 476534765834465, address: 'г.Мантурово, ул.Ленина, 58' },
    { id: 4, name: 'ОАО "Альфабанк"', bik: '01234567123', coracc: 476534765834465, address: 'г.Ростов на Дону, ул.Ленина, 32' },
    { id: 5, name: 'ОАО КБ "Банк Москвы"', bik: '0123456456', coracc: 476534765834465, address: 'г.Москва, Проспект Мира, 100' }
]

export default {
    getList() {
        return new Promise((resolve, reject) => {
            // TODO: обработка ошибок 
            setTimeout(() => resolve(list), 500)
        })
    }
}